Revit 2027 API
PanelScheduleData.IsHeaderSectionHidden Property
 True if the user wishes to hide the header section; setting this value must go through the appropriate update function
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsHeaderSectionHidden { get; }
Public ReadOnly Property IsHeaderSectionHidden As Boolean
	Get
public:
property bool IsHeaderSectionHidden {
	bool get ();
}
member IsHeaderSectionHidden : bool with get
Property Value
Boolean
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace